lkolbly/cmsis-svd/data/TexasInstruments/LM3S5749.svd
        <register>
          <name>_0_INTEN</name>
          <description>PWM0 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>PWM_X_INTEN_INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCNTLOAD</name>
              <description>Interrupt for Counter=PWMnLOAD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPAU</name>
              <description>Interrupt for Counter=PWMnCMPA Up</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPAD</name>
              <description>Interrupt for Counter=PWMnCMPA Down</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPBU</name>
              <description>Interrupt for Counter=PWMnCMPB Up</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPBD</name>
              <description>Interrupt for Counter=PWMnCMPB Down</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCNTLOAD</name>
              <description>Trigger for Counter=PWMnLOAD</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPAU</name>
              <description>Trigger for Counter=PWMnCMPA Up</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPAD</name>
              <description>Trigger for Counter=PWMnCMPA Down</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPBU</name>
              <description>Trigger for Counter=PWMnCMPB Up</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPBD</name>
              <description>Trigger for Counter=PWMnCMPB Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_RIS</name>
          <description>PWM0 Raw Interrupt Status</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>PWM_X_RIS_INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_ISC</name>
          <description>PWM0 Interrupt Status and Clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_LOAD</name>
          <description>PWM0 Load</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>PWM_X_LOAD</name>
              <description>Counter Load Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_COUNT</name>
          <description>PWM0 Counter</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>PWM_X_COUNT</name>
              <description>Counter Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_CMPA</name>
          <description>PWM0 Compare A</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>PWM_X_CMPA</name>
              <description>Comparator A Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_CMPB</name>
          <description>PWM0 Compare B</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_CMPB</name>
              <description>Comparator B Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_GENA</name>
          <description>PWM0 Generator A Control</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>PWM_X_GENA_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTZERO_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTZERO_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTZERO_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENA_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTLOAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTLOAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTLOAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENA_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENA_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENA_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENA_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENA_ACTCMPBD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_GENB</name>
          <description>PWM0 Generator B Control</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>PWM_X_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTZERO_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTLOAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_GENB_ACTCMPBD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBCTL</name>
          <description>PWM0 Dead-Band Control</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBRISE</name>
          <description>PWM0 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBRISE_DELAY</name>
              <description>Dead-Band Rise Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBFALL</name>
          <description>PWM0 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>PWM_X_DBFALL_DELAY</name>
              <description>Dead-Band Fall Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSRC0</name>
          <description>PWM0 Fault Source 0</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSRC0_FAULT0</name>
              <description>Fault0 Input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT2</name>
              <description>Fault2 Input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_MINFLTPER</name>
          <description>PWM0 Minimum Fault Period</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
