lkolbly/cmsis-svd/data/TexasInstruments/LM3S5749.svd
        <register>
          <name>TXHUBPORT1</name>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR1</name>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR1</name>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR1_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT1</name>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR2</name>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000090</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR2</name>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000092</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT2</name>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000093</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR2</name>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR2</name>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT2</name>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR3</name>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR3</name>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR3_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT3</name>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR3</name>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR3</name>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR3_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT3</name>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000009F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_ERROR</name>
              <description>Error</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STATUS</name>
              <description>STATUS Packet</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRH0</name>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TYPE0</name>
          <description>USB Type Endpoint 0</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TYPE0_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NAKLMT</name>
          <description>USB NAK Limit</description>
          <addressOffset>0x0000010B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_NAKLMT_NAKLMT</name>
              <description>EP0 NAK Limit</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH1</name>
          <description>USB Transmit Control and Status Endpoint 1 High</description>
          <addressOffset>0x00000113</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH1_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP1</name>
          <description>USB Maximum Receive Data Endpoint 1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL1</name>
          <description>USB Receive Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000116</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL1_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL1</name>
          <description>USB Receive Control and Status Endpoint 1 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000116</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL1_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH1</name>
          <description>USB Receive Control and Status Endpoint 1 High</description>
          <addressOffset>0x00000117</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH1_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
